IDEA StatiCa Open Model
Element1D.CrossSectionEnd Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets, sets cross section located at the end of this element1D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement CrossSectionEnd { get; set; }
Public Property CrossSectionEnd As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ CrossSectionEnd {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
Element1D Class
IdeaRS.OpenModel.Model Namespace